---
kind: method
id: M:Autodesk.Revit.DB.CADLinkOptions.Dispose
source: html/4663dac1-efd3-703a-687d-76cddbb05a40.htm
---
# Autodesk.Revit.DB.CADLinkOptions.Dispose Method

Releases all resources used by the CADLinkOptions

## Syntax (C#)
```csharp
public void Dispose()
```